import streamlit as st

from PIL import Image


st.set_page_config(page_title="Asthma Risk Screening Tool")

if "page" not in st.session_state:
    st.session_state.page = "form"



if st.session_state.page == "form":

    st.title("แบบสอบถามคัดกรองอาการของโรคหอบหืด")

    st.write(">*** หมายเหตุ: เครื่องมือนี้ใช้สำหรับวัดระดับความรุนแรงของอาการโรคหอบหืดเท่านั้น และไม่สามารถใช้แทนการวินิจฉัยทางการแพทย์โดยผู้เชี่ยวชาญได้ ***")

    st.subheader("ข้อมูลพื้นฐาน")

    gender = st.selectbox("เพศ", ["ชาย","หญิง"])
    age = st.number_input("อายุ",1,100)
    bmi = st.number_input("ค่า BMI (ค่าดัชนีมวลกาย)",10.0,50.0)

    st.subheader("PM2.5 Level (Optional)")

    pm25 = st.number_input("ค่าฝุ่น PM2.5 (µg/m³) ในปัจจุบัน",0,200)

    if pm25 <= 15:
        st.success("อากาศปลอดภัย")
    elif pm25 <= 35:
        st.info("เริ่มมีผลต่อผู้ป่วยโรคหอบหืด")
    elif pm25 <= 60:
        st.warning("ไม่ดีต่อผู้ป่วยโรคทางเดินหายใจ")
    else:
        st.error("อันตรายมาก ควรหลีกเลี่ยงกิจกรรมกลางแจ้ง")


    st.header("อาการของโรคหอบหืดในปัจจุบัน")

    symptom_freq = st.selectbox(
    "1. ท่านมีอาการหอบ หายใจลำบาก หรือหายใจไม่สะดวกบ่อยแค่ไหนในช่วง 4 สัปดาห์ที่ผ่านมา",
    ["ไม่เลย","≤2 ครั้ง/สัปดาห์","3-4 ครั้ง/สัปดาห์","5-6 ครั้ง/สัปดาห์","ทุกวัน"]
    )

    night_symptom = st.selectbox(
    "2. ท่านมีอาการหอบในเวลากลางคืน จนทำให้ต้องตื่นจากการนอนหลับ หรือรบกวนการนอนหลับหรือไม่",
    ["ไม่เลย","≤2 ครั้ง/เดือน","3-4 ครั้ง/เดือน","1-2 ครั้ง/สัปดาห์","≥3 ครั้ง/สัปดาห์"]
    )

    inhaler_use = st.selectbox(
    "3. ท่านใช้ยาพ่นสูด (inhaler) ประเภทยาบรรเทาอาการเมื่อหอบหืดกำเริบ เพื่อบรรเทาอาการหอบหรือหายใจลำบากบ่อยแค่ไหน",
    ["ไม่เลย","≤2 ครั้ง/สัปดาห์","3-6 ครั้ง/สัปดาห์","ทุกวัน","หลายครั้ง/วัน"]
    )

    activity_limit = st.selectbox(
    "4. อาการหอบหืดของท่าน ส่งผลกระทบต่อการทำกิจกรรมหรือการใช้ชีวิตประจำวันมากน้อยแค่ไหน",
    ["ไม่เลย","เล็กน้อย","ปานกลาง","มาก"]
    )





    st.write("5. ตอนนี้ท่านมีอาการเหล่านี้หรือไม่")

    severe_breath = st.checkbox("หายใจลำบากมาก เช่น หายใจไม่ออกหรือแน่นหน้าอกมาก")
    cannot_speak = st.checkbox("พูดเป็นประโยคยาวไม่ได้")
    blue_lips = st.checkbox("ริมฝีปากหรือเล็บเป็นสีเขียว")
    inhaler_noeffect = st.checkbox("ใช้ยาพ่นขยายหลอดลมแล้วอาการไม่ดีขึ้น หรืออาการกลับมาเป็นซ้ำภายในเวลาอันรวดเร็ว")
    wheezing = st.checkbox("หายใจมีเสียงหวีด (Wheezing) ดังมาก")
    confusion = st.checkbox("มีอาการทางสมอง: สับสน กระสับกระส่าย หรือหมดสติ")



    st.header("ประวัติการกำเริบ")

    er_visit = st.selectbox(
    "6. ท่านเคยเข้ารับการรักษาที่ ห้องฉุกเฉิน (ER) เนื่องจากอาการหอบหืดหรือไม่",
    ["ไม่เคย","1 ครั้ง","2-3 ครั้ง",">3 ครั้ง"]
    )

    hospital_admit = st.selectbox(
    "7. ท่านเคยเข้ารับการรักษาในโรงพยาบาล (นอนโรงพยาบาล) เนื่องจากอาการหอบหืดหรือไม่",
    ["ไม่เคย","เคย"]
    )

    ventilator = st.selectbox(
    "8. ท่านเคยต้องใช้เครื่องช่วยหายใจ เนื่องจากอาการหอบหืดหรือไม่",
    ["ไม่เคย","1 ครั้ง","2-3 ครั้ง",">3 ครั้ง"]
    )



    if st.button("คำนวณระดับความเสี่ยง"):

        if (
            cannot_speak or
            blue_lips or
            severe_breath or
            inhaler_noeffect or
            wheezing or
            confusion
        ):
            st.session_state.page = "emergency"
            st.rerun()




        score = 0

        symptom_score = {
            "ไม่เลย":0,
            "≤2 ครั้ง/สัปดาห์":0,
            "3-4 ครั้ง/สัปดาห์":1,
            "5-6 ครั้ง/สัปดาห์":2,
            "ทุกวัน":3
        }

        night_score = {
            "ไม่เลย":0,
            "≤2 ครั้ง/เดือน":0,
            "3-4 ครั้ง/เดือน":1,
            "1-2 ครั้ง/สัปดาห์":2,
            "≥3 ครั้ง/สัปดาห์":3
        }

        inhaler_score = {
            "ไม่เลย":0,
            "≤2 ครั้ง/สัปดาห์":0,
            "3-6 ครั้ง/สัปดาห์":1,
            "ทุกวัน":2,
            "หลายครั้ง/วัน":3
        }

        activity_score = {
            "ไม่เลย":0,
            "เล็กน้อย":1,
            "ปานกลาง":2,
            "มาก":3
        }

        score += symptom_score[symptom_freq]
        score += night_score[night_symptom]
        score += inhaler_score[inhaler_use]
        score += activity_score[activity_limit]


        history_score = {
            "ไม่เคย":0,
            "1 ครั้ง":1,
            "2-3 ครั้ง":2,
            ">3 ครั้ง":3
        }

        score += history_score[er_visit]
        score += history_score[ventilator]

        if hospital_admit == "เคย":
            score += 3



        if age < 12 or age > 60:
            score += 1



        if bmi >= 30:
            score += 2


        if pm25 > 75:
            score += 3
        elif pm25 > 35:
            score += 2
        elif pm25 > 15:
            score += 1


      
        


        st.session_state.score = score
        st.session_state.page = "result"
        st.rerun()




elif st.session_state.page == "result":

    score = st.session_state.score

    st.title("ผลการประเมิน")

    st.metric("Risk Score",score)

    
    if score <= 4:

        st.success("ระดับอาการ: Intermittent Asthma (หอบหืดเป็นครั้งคราว)")
        st.write("""วิธีดูแลตนเองสำหรับระดับอาการ: Intermittent Asthma (หอบหืดเป็นครั้งคราว)
- หลีกเลี่ยงสิ่งกระตุ้น เช่น ฝุ่น ควันบุหรี่ ควันรถ สารเคมี และเกสรดอกไม้
- สามารถออกกำลังกายได้ตามปกติ แต่ควรวอร์มร่างกายก่อน
- พกยาพ่นขยายหลอดลม (ยาบรรเทาอาการ) ติดตัวไว้ใช้เมื่อมีอาการ
- สังเกตอาการของตนเอง เช่น ไอ หายใจมีเสียงหวีด หรือแน่นหน้าอก
- พักผ่อนให้เพียงพอ และดูแลสุขภาพโดยรวมให้แข็งแรง
""")

    elif score <= 8:

        st.info("ระดับอาการ: Mild Persistent Asthma (หอบหืดเรื้อรังระดับเล็กน้อย)")
        st.write("""วิธีดูแลตัวเองสำหรับระดับอาการ: Mild Persistent Asthma (หอบหืดเรื้อรังระดับเล็กน้อย)
- ใช้ยาพ่นควบคุมการอักเสบของหลอดลมตามแพทย์สั่งสม่ำเสมอ
- พกยาพ่นบรรเทาอาการติดตัวเสมอ
- จดบันทึกอาการหรือสิ่งกระตุ้นที่ทำให้เกิดอาการ
- ออกกำลังกายได้ แต่ควรเลือกกิจกรรมที่ไม่หักโหม เช่น เดิน หรือว่ายน้ำ""")

    elif score <= 13:

        st.warning("ระดับอาการ: Moderate Persistent Asthma (หอบหืดเรื้อรังระดับปานกลาง)")
        st.write("""วิธีดูแลตัวเองสำหรับระดับอาการ: Moderate Persistent Asthma (หอบหืดเรื้อรังระดับปานกลาง)
- ใช้ยาควบคุมโรคทุกวันอย่างเคร่งครัด
- พกยาพ่นฉุกเฉินตลอดเวลา
- เรียนรู้การใช้เครื่องพ่นยาอย่างถูกวิธี
- สังเกตอาการเตือน เช่น หายใจเร็ว แน่นหน้าอก หรือไอมากขึ้น
- อาจใช้เครื่องวัดสมรรถภาพปอด (Peak Flow Meter) เพื่อติดตามอาการ
""")

    else:

        st.error("ระดับอาการ: Severe Persistent Asthma (หอบหืดเรื้อรังระดับรุนแรง)")
        st.write("""วิธีดูแลตัวเองสำหรับระดับอาการ: Severe Persistent Asthma (หอบหืดเรื้อรังระดับรุนแรง)
- ใช้ยาควบคุมโรคหลายชนิดตามแพทย์สั่งอย่างเคร่งครัด
- พกยาพ่นฉุกเฉินติดตัวตลอดเวลา
- สังเกตสัญญาณอันตราย เช่น หายใจลำบากมาก พูดเป็นประโยคยาวไม่ได้ และหน้าอกบุ๋มเวลาหายใจ
- หากมีอาการรุนแรงควรรีบไปโรงพยาบาลทันที
""")
        

    img = Image.open("risk_score.png")
    st.image(img, width = 1000)



    if st.button("ทำแบบคัดกรองใหม่อีกครั้ง"):

        st.session_state.page = "form"
        st.rerun()




elif st.session_state.page == "emergency":

    st.title("🚨 Emergency Warning 🚨")

    st.error("คุณอาจมีอาการหอบหืดรุนแรง แนะนำให้ไปโรงพยาบาลหรือห้องฉุกเฉิน (Emergency Room) ทันที")

    st.write(
    "อาการรุนแรงของโรคหอบหืดอาจทำให้การหายใจลำบากและระดับออกซิเจนในเลือดลดลง ซึ่งต้องได้รับการดูแลจากแพทย์โดยเร็ว"
    )


    st.write("""สิ่งที่ควรทำทันที
- ใช้ reliever inhaler (ยาพ่นบรรเทาอาการ) ตามคำแนะนำของแพทย์

- นั่งตัวตรงเพื่อช่วยให้หายใจสะดวกขึ้น

- หลีกเลี่ยงการนอนราบ

- ให้คนใกล้ตัวช่วยพาไป โรงพยาบาลหรือห้องฉุกเฉิน

หากอาการแย่ลงอย่างรวดเร็ว ให้ โทรขอความช่วยเหลือทางการแพทย์\n
ในประเทศไทยสามารถโทร 1669 เพื่อขอรถพยาบาลฉุกเฉิน""")



    if st.button("ย้อนกลับ"):

        st.session_state.page = "form"
        st.rerun()