import streamlit as st

from PIL import Image

st.set_page_config(page_title="Asthma Risk Screening Tool")

st.title("ข้อมูลที่ควรรู้เกี่ยวกับโรคหอบหืด")


img = Image.open("ภาพเปรียบเทียบอาการ.jpg")
st.image(img, width = 550)



st.subheader("โรคหอบหืดคืออะไร?")
st.markdown("""
โรคหอบหืด หรือ Asthma เป็นโรคเรื้อรังของระบบทางเดินหายใจที่เกิดจากการอักเสบของหลอดลม ทำให้หลอดลมมีความไวต่อสิ่งกระตุ้นต่าง ๆ มากกว่าปกติ เมื่อได้รับสิ่งกระตุ้น หลอดลมจะเกิดการหดตัว บวม และมีการสร้างเสมหะมากขึ้น ส่งผลให้ทางเดินหายใจแคบลง ผู้ป่วยจึงหายใจลำบาก มีอาการหอบ แน่นหน้าอก หรือมีเสียงหวีดขณะหายใจ โรคนี้สามารถเกิดได้กับคนทุกวัย แต่พบได้บ่อยในเด็กและวัยรุ่น และมักมีลักษณะอาการเป็น ๆ หาย ๆ โดยช่วงที่อาการกำเริบจะเรียกว่าอาการหอบกำเริบ
""")



st.subheader("อาการที่พบบ่อย")
st.markdown("""
- หายใจลำบาก  
- แน่นหน้าอก  
- มีเสียงหวีดขณะหายใจ  
- ไอ โดยเฉพาะตอนกลางคืนหรือหลังออกกำลังกาย
""")



st.subheader("สิ่งกระตุ้นที่พบบ่อย")
st.markdown("""
สิ่งกระตุ้นสามารถทำให้อาการหอบหืดกำเริบได้ เช่น

- ฝุ่นละออง โดยเฉพาะ PM2.5  
- ควันบุหรี่  
- เกสรดอกไม้  
- ขนสัตว์  
- อากาศเย็น  
- การออกกำลังกายหนัก
""")


st.subheader("วิธีป้องกันและลดความเสี่ยงของโรคหอบหืด")
st.markdown("""
- หลีกเลี่ยงฝุ่นละออง ควันบุหรี่ และมลพิษทางอากาศ
- ทำความสะอาดบ้านและที่นอนเพื่อลดไรฝุ่น
- หลีกเลี่ยงสารก่อภูมิแพ้ เช่น เกสรดอกไม้ หรือขนสัตว์ หากแพ้
- ออกกำลังกายอย่างเหมาะสมและสม่ำเสมอ
- รักษาสุขภาพให้แข็งแรงและพักผ่อนให้เพียงพอ
- ใช้ยาตามคำแนะนำของแพทย์อย่างสม่ำเสมอ
- หลีกเลี่ยงการอยู่ในที่อากาศเย็นหรือแห้งเกินไป
- ฉีดวัคซีนป้องกันโรคทางเดินหายใจ เช่น วัคซีนไข้หวัดใหญ่
""")

st.divider()

st.subheader("ระดับ PM2.5 (µg/m³) และความเสี่ยงต่อผู้ป่วยหอบหืด")
st.table({
"ค่าฝุ่น PM2.5 (µg/m³)": ["0-15", "16-25", "26-37", "38+"],
"ระดับความเสี่ยง": [
"ปลอดภัย",
"เริ่มมีความเสี่ยง",
"อาจกระตุ้นอาการหอบหืด",
"อันตรายต่อผู้ป่วยหอบหืด"
]
})






st.divider()

st.subheader("PM2.5 มีผลต่อผู้ป่วยหอบหืดอย่างไร")
st.markdown("""
ฝุ่น PM2.5 เป็นฝุ่นขนาดเล็กมากที่สามารถเข้าสู่ปอดได้ลึก ทำให้ผู้ป่วยโรคหอบหืดได้รับผลกระทบได้ง่าย เมื่อสูดดมเข้าไปจะกระตุ้นให้หลอดลมเกิดการระคายเคืองและอักเสบ ทำให้หลอดลมตีบแคบลง ส่งผลให้หายใจลำบาก ไอ แน่นหน้าอก หรือมีเสียงหวีด และอาจทำให้อาการหอบหืดกำเริบได้ง่ายขึ้น หากได้รับฝุ่นในปริมาณมากหรือเป็นเวลานาน อาจทำให้สมรรถภาพปอดลดลง และเพิ่มความเสี่ยงต่อการติดเชื้อในระบบทางเดินหายใจ
""")

st.info("💡 ผู้ป่วยโรคหอบหืดควรตรวจสอบค่าฝุ่นก่อนออกจากบ้าน")




















st.divider()

st.subheader("ความเชื่อ vs ความจริง")

col1, col2 = st.columns(2)

with col1:
    st.subheader("❌ ความเชื่อ")
    st.markdown("""
- หอบหืดรักษาให้หายไม่ได้เลย
- ถ้าไม่มีอาการก็ไม่จำเป็นต้องใช้ยา
- คนเป็นหอบหืดออกกำลังกายไม่ได้
- เมื่ออาการดีขึ้นแล้วสามารถหยุดยาเองได้
- ใช้ยาพ่นบ่อย ๆ จะทำให้ติดยา
    """)

with col2:
    st.subheader("✅ ความจริง")
    st.markdown("""
- สามารถควบคุมอาการได้ด้วยการรักษาที่เหมาะสม
- ควรใช้ยาตามแพทย์สั่งอย่างสม่ำเสมอ
- สามารถออกกำลังกายได้ หากควบคุมโรคได้ดี
- ไม่ควรหยุดยาเอง ควรปรึกษาแพทย์ก่อน
- ยาพ่นเป็นยาหลักในการรักษา และควรใช้ตามคำแนะนำของแพทย์เพื่อความปลอดภัย
    """)

st.divider()

st.subheader("🚨 สัญญาณอันตรายที่ควรรีบพบแพทย์")

st.error("""
หากมีอาการต่อไปนี้ ควรรีบไปโรงพยาบาลทันที

- หายใจลำบากมาก  
- พูดเป็นประโยคยาวไม่ได้  
- ริมฝีปากหรือเล็บเป็นสีเขียว
- ใช้ยาพ่นขยายหลอดลมแล้วอาการไม่ดีขึ้น หรืออาการกลับมาเป็นซ้ำภายในเวลาอันรวดเร็ว
- หายใจมีเสียงหวีด (Wheezing) ดังมาก
- มีอาการทางสมอง: สับสน กระสับกระส่าย หรือหมดสติ
""")

st.divider()

st.subheader("วิธีดูแลตัวเองสำหรับผู้ป่วยหอบหืด")

st.markdown("""
- ใช้ยาควบคุมโรคตามที่แพทย์สั่งอย่างเคร่งครัด  
- พกยาพ่นฉุกเฉินติดตัวเสมอ  
- หลีกเลี่ยงสิ่งกระตุ้น เช่น ฝุ่น ควันบุหรี่ หรือสารก่อภูมิแพ้  
- ตรวจสอบคุณภาพอากาศก่อนออกจากบ้าน  
- พบแพทย์ตามนัดอย่างสม่ำเสมอ
""")

st.success("การดูแลตัวเองและหลีกเลี่ยงสิ่งกระตุ้นสามารถช่วยลดการกำเริบของโรคได้")





st.divider()
st.subheader("เอกสารเพิ่มเติม")

st.markdown("""
1. Thai Asthma Council. (2025). แนวทางการวินิจฉัยและรักษาโรคหืดในประเทศไทยสำหรับผู้ใหญ่ 2568  
https://www.tac.or.th/wp-content/uploads/2025/03/TAC-Guideline-2025.pdf

2. (ผู้แต่งไม่ระบุ). (2567). ปัจจัยทำนายการควบคุมโรคในผู้ป่วยโรคหืด โรงพยาบาลบ้านแพ้ว  จังหวัดสมุทรสาคร.
https://he02.tci-thaijo.org/index.php/tjph/article/view/268728/185145

3. (ผู้แต่งไม่ระบุ). (2563). การพัฒนารูปแบบการดูแลผู้ป่วยโรคหืดในชุมชน  
https://he01.tci-thaijo.org/index.php/bcnsurin/article/view/245820/169228

4. (ผู้แต่งไม่ระบุ). (ไม่ระบุปี). การจัดการดูแลผู้ป่วยโรคหืด  
https://he03.tci-thaijo.org/index.php/ech/article/view/3044/2262

5. Mahidol University Faculty of Medicine Ramathibodi Hospital. (ไม่ระบุปี). Management patient with asthma https://www.rama.mahidol.ac.th/med/sites/default/files/public/pdf/medicinebook1/management%20of%20patient%20with%20asthma.pdf

6. Ramathibodi School of Nursing. (2011). การพยาบาลผู้ป่วยโรคหืด  
https://www.rama.mahidol.ac.th/ramanursej/sites/default/files/Public/journal-files/RNJ-V17-N03-OCT-DEC-2011-01.pdf

7. (ผู้แต่งไม่ระบุ). (ไม่ระบุปี). การจัดการดูแลผู้ป่วยโรคหืดในชุมชน  
https://he01.tci-thaijo.org/index.php/jmpubu/article/view/256419/174496
""")